# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroup..::..Id Property
LightGroup Class See Also
---
The ElementId of the LightGroup
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

# See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace